Управление_гостиницами_EDT/src/Documents/УстановкаЦенНомеровУслуг/УстановкаЦенНомеровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНомеровУслуг</name>
  <registerRecords>InformationRegister.ЦеныУслуг</registerRecords>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>ОбъектЦены</name>
      <type>
        <types>DefinedType.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалЦены</name>
      <type>
        <types>CatalogRef.ИнтервалыСезонныхЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИнтервала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыИнтервалов</name>
    <attributes>
      <name>ИнтервалЦены</name>
      <type>
        <types>CatalogRef.ИнтервалыСезонныхЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИнтервала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДляНомеров</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДляУслуг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтарыйЦены</name>
    <attributes>
      <name>ОбъектЦены</name>
      <type>
        <types>DefinedType.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_гостиницами_EDT/src/InformationRegisters/ЦеныУслуг/ЦеныУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныУслуг</name>
  <comment>Цены на услуги проживания и дополнительные услуги</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>DefinedType.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/Documents/УстановкаЦенНомеровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСОбытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЦеныУслуг
	Движения.ЦеныУслуг.Записывать = Истина;
	Если НЕ СтарыйЦены.Количество() = 0 Тогда
		Для Каждого ТекСтрокаЦены Из СтарыйЦены Цикл
			Движение = Движения.ЦеныУслуг.Добавить();
			Движение.Период = НачалоДня(Дата);
			Движение.Гостиница = Гостиница;
			Движение.Услуга = ТекСтрокаЦены.ОбъектЦены;
			Движение.Корпус = Корпус;
			Движение.Цена = ТекСтрокаЦены.Цена;
		КонецЦикла;                              
	КонецЕсли;
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		Движение = Движения.ЦеныУслуг.Добавить();
		Движение.Период = ТекСтрокаЦены.ДатаИнтервала;
		Движение.Гостиница = Гостиница;
		Движение.Услуга = ТекСтрокаЦены.ОбъектЦены;
		Движение.Корпус = Корпус;
		Движение.Цена = ТекСтрокаЦены.Цена;
	КонецЦикла;                              	
	

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ Гостиница.ГостиничныйКомплекс Тогда
	
		НомерЭлемента = ПроверяемыеРеквизиты.Найти("Корпус");
		Если НЕ НомерЭлемента = Неопределено Тогда
		
			ПроверяемыеРеквизиты.Удалить(НомерЭлемента);
		
		КонецЕсли; 
		
	
	КонецЕсли;     
КонецПроцедуры

#КонецОбласти 
	
#КонецЕсли
